{"weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"dtype": "float32", "shape": [10, 512], "name": "dense_8/kernel"}, {"dtype": "float32", "shape": [512], "name": "dense_8/bias"}, {"dtype": "float32", "shape": [512, 512], "name": "dense_9/kernel"}, {"dtype": "float32", "shape": [512], "name": "dense_9/bias"}, {"dtype": "float32", "shape": [512, 784], "name": "dense_10/kernel"}, {"dtype": "float32", "shape": [784], "name": "dense_10/bias"}]}], "modelTopology": {"keras_version": "2.2.4", "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 10], "name": "input_3", "sparse": false}, "name": "input_3"}, {"class_name": "Sequential", "inbound_nodes": [[["input_3", 0, 0, {}]]], "config": {"layers": [{"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_8", "bias_regularizer": null, "bias_constraint": null, "dtype": "float32", "activation": "linear", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "batch_input_shape": [null, 10], "use_bias": true, "activity_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_5"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_9", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "use_bias": true, "activity_regularizer": null}}, {"class_name": "LeakyReLU", "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_6"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_10", "bias_regularizer": null, "bias_constraint": null, "activation": "tanh", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 784, "use_bias": true, "activity_regularizer": null}}, {"class_name": "Reshape", "config": {"target_shape": [28, 28, 1], "trainable": true, "name": "reshape_1"}}], "name": "sequential_2"}, "name": "sequential_2"}], "output_layers": [["sequential_2", 1, 0]], "name": "model_3", "input_layers": [["input_3", 0, 0]]}}, "backend": "tensorflow"}, "generatedBy": "keras v2.2.4", "convertedBy": "TensorFlow.js Converter v1.0.1", "format": "layers-model"}
