{"weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"dtype": "float32", "shape": [784, 512], "name": "dense_14/kernel"}, {"dtype": "float32", "shape": [512], "name": "dense_14/bias"}, {"dtype": "float32", "shape": [512, 512], "name": "dense_15/kernel"}, {"dtype": "float32", "shape": [512], "name": "dense_15/bias"}, {"dtype": "float32", "shape": [512, 10], "name": "dense_16/kernel"}, {"dtype": "float32", "shape": [10], "name": "dense_16/bias"}, {"dtype": "float32", "shape": [512, 10], "name": "dense_17/kernel"}, {"dtype": "float32", "shape": [10], "name": "dense_17/bias"}]}], "modelTopology": {"keras_version": "2.2.4", "model_config": {"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"dtype": "float32", "batch_input_shape": [null, 28, 28, 1], "name": "input_6", "sparse": false}, "name": "input_6"}, {"class_name": "Flatten", "inbound_nodes": [[["input_6", 0, 0, {}]]], "config": {"trainable": true, "name": "flatten_2", "data_format": "channels_last"}, "name": "flatten_2"}, {"class_name": "Dense", "inbound_nodes": [[["flatten_2", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_14", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "use_bias": true, "activity_regularizer": null}, "name": "dense_14"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["dense_14", 0, 0, {}]]], "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_9"}, "name": "leaky_re_lu_9"}, {"class_name": "Dense", "inbound_nodes": [[["leaky_re_lu_9", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_15", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 512, "use_bias": true, "activity_regularizer": null}, "name": "dense_15"}, {"class_name": "LeakyReLU", "inbound_nodes": [[["dense_15", 0, 0, {}]]], "config": {"alpha": 0.20000000298023224, "trainable": true, "name": "leaky_re_lu_10"}, "name": "leaky_re_lu_10"}, {"class_name": "Dense", "inbound_nodes": [[["leaky_re_lu_10", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_16", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 10, "use_bias": true, "activity_regularizer": null}, "name": "dense_16"}, {"class_name": "Dense", "inbound_nodes": [[["leaky_re_lu_10", 0, 0, {}]]], "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "seed": null, "mode": "fan_avg"}}, "name": "dense_17", "bias_regularizer": null, "bias_constraint": null, "activation": "linear", "trainable": true, "kernel_constraint": null, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 10, "use_bias": true, "activity_regularizer": null}, "name": "dense_17"}, {"class_name": "Lambda", "inbound_nodes": [[["dense_16", 0, 0, {}], ["dense_17", 0, 0, {}]]], "config": {"function": ["4wEAAAAAAAAAAQAAAAUAAABTAAAAcy4AAAB8AGQBGQB0AGoBdABqAnwAZAEZAIMBgwF0AGoDfABk\nAhkAZAMbAIMBFAAXAFMAKQRO6QAAAADpAQAAAOkCAAAAKQTaAUvaDXJhbmRvbV9ub3JtYWzaBXNo\nYXBl2gNleHApAdoBcKkAcgkAAAD6HjxpcHl0aG9uLWlucHV0LTItZTgwZTc4MjZkZTFhPtoIPGxh\nbWJkYT5HAAAAcwAAAAA=\n", null, null], "name": "lambda_2", "trainable": true, "function_type": "lambda", "output_shape_type": "lambda", "output_shape": ["4wEAAAAAAAAAAQAAAAIAAABTAAAAcwgAAAB8AGQBGQBTACkCTukAAAAAqQApAdoBcHICAAAAcgIA\nAAD6HjxpcHl0aG9uLWlucHV0LTItZTgwZTc4MjZkZTFhPtoIPGxhbWJkYT5IAAAAcwAAAAA=\n", null, null], "arguments": {}}, "name": "lambda_2"}], "output_layers": [["lambda_2", 0, 0]], "name": "model_6", "input_layers": [["input_6", 0, 0]]}}, "backend": "tensorflow"}, "generatedBy": "keras v2.2.4", "convertedBy": "TensorFlow.js Converter v1.0.1", "format": "layers-model"}